### 1-Importar pandas e numpy

In [2]:
import pandas as pd
import numpy as np

2 - Criar Objeto

In [3]:
series = pd.Series([1,3,5, np.nan, 6,8])
series

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

### 3 - Criar Dataframe passando um array Numpy

In [4]:
dates = pd.date_range('20220101', periods=6)
dates

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2022-01-01 -1.617605 -1.654238 -0.219917  1.470265
2022-01-02  0.476262  0.090179  3.059522 -0.730155
2022-01-03 -0.478995 -1.310525  0.643576  1.335813
2022-01-04 -0.339181 -0.168893  1.508616  0.201894
2022-01-05 -1.202923  0.487656  1.080697  1.438230
2022-01-06 -0.916765  0.393163 -0.278418  0.983764

### 4 - Criar Dataframe passando por Dicionário de objeto

In [6]:
df2 = pd.DataFrame(
    {
        'A' : 1.0,
        'B' : pd.Timestamp('20220623'),
        'C' : pd.Series(1, index=list(range(4)), dtype='float32'),
        'D' : np.array([3] * 4, dtype='int32'),
        'E' : pd.Categorical(['test', 'train', 'test', 'train']),
        'F' : 'foo'
    })

df2

     A          B    C  D      E    F
0  1.0 2022-06-23  1.0  3   test  foo
1  1.0 2022-06-23  1.0  3  train  foo
2  1.0 2022-06-23  1.0  3   test  foo
3  1.0 2022-06-23  1.0  3  train  foo

In [7]:
#As colunas do Resultado do DataFrame possuim diferente dtypes
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

### 5 - Visualizar Dados

In [8]:
df.head()

                   A         B         C         D
2022-01-01 -1.617605 -1.654238 -0.219917  1.470265
2022-01-02  0.476262  0.090179  3.059522 -0.730155
2022-01-03 -0.478995 -1.310525  0.643576  1.335813
2022-01-04 -0.339181 -0.168893  1.508616  0.201894
2022-01-05 -1.202923  0.487656  1.080697  1.438230

In [9]:
df.tail(3)

                   A         B         C         D
2022-01-04 -0.339181 -0.168893  1.508616  0.201894
2022-01-05 -1.202923  0.487656  1.080697  1.438230
2022-01-06 -0.916765  0.393163 -0.278418  0.983764

In [10]:
df.index

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
# Descrever a tabela
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.679868 -0.360443  0.965679  0.783302
std    0.735134  0.905926  1.244938  0.880328
min   -1.617605 -1.654238 -0.278418 -0.730155
25%   -1.131384 -1.025117 -0.004044  0.397361
50%   -0.697880 -0.039357  0.862136  1.159788
75%   -0.374135  0.317417  1.401636  1.412626
max    0.476262  0.487656  3.059522  1.470265

In [13]:
# Tranpor os Dados
df.T

   2022-01-01  2022-01-02  2022-01-03  2022-01-04  2022-01-05  2022-01-06
A   -1.617605    0.476262   -0.478995   -0.339181   -1.202923   -0.916765
B   -1.654238    0.090179   -1.310525   -0.168893    0.487656    0.393163
C   -0.219917    3.059522    0.643576    1.508616    1.080697   -0.278418
D    1.470265   -0.730155    1.335813    0.201894    1.438230    0.983764

In [14]:
# Ordenar por Eixo
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2022-01-01  1.470265 -0.219917 -1.654238 -1.617605
2022-01-02 -0.730155  3.059522  0.090179  0.476262
2022-01-03  1.335813  0.643576 -1.310525 -0.478995
2022-01-04  0.201894  1.508616 -0.168893 -0.339181
2022-01-05  1.438230  1.080697  0.487656 -1.202923
2022-01-06  0.983764 -0.278418  0.393163 -0.916765

In [15]:
# Classificando Valores
df.sort_values(by='B')

                   A         B         C         D
2022-01-01 -1.617605 -1.654238 -0.219917  1.470265
2022-01-03 -0.478995 -1.310525  0.643576  1.335813
2022-01-04 -0.339181 -0.168893  1.508616  0.201894
2022-01-02  0.476262  0.090179  3.059522 -0.730155
2022-01-06 -0.916765  0.393163 -0.278418  0.983764
2022-01-05 -1.202923  0.487656  1.080697  1.438230

### 6 - Seleção de Dados

In [16]:
# Selecionando uma única coluna, que produz um Series, equivalente a df.A:
df['A']

2022-01-01   -1.617605
2022-01-02    0.476262
2022-01-03   -0.478995
2022-01-04   -0.339181
2022-01-05   -1.202923
2022-01-06   -0.916765
Freq: D, Name: A, dtype: float64

In [23]:
# Selecionando via [], que corta as linhas:
df[0:3]

                   A         B         C         D
2022-01-01 -1.617605 -1.654238 -0.219917  1.470265
2022-01-02  0.476262  0.090179  3.059522 -0.730155
2022-01-03 -0.478995 -1.310525  0.643576  1.335813

In [24]:
df['2022-01-03':'2022-01-05']

                   A         B         C         D
2022-01-03 -0.478995 -1.310525  0.643576  1.335813
2022-01-04 -0.339181 -0.168893  1.508616  0.201894
2022-01-05 -1.202923  0.487656  1.080697  1.438230

### 7 - Seleção por rótulo

In [25]:
# Para obter uma seção transversal usando um rótulo:
df.loc[dates[0]]

A   -1.617605
B   -1.654238
C   -0.219917
D    1.470265
Name: 2022-01-01 00:00:00, dtype: float64

In [32]:
# Selecionando em um multieixo por rótulo:
df.loc[:, ['A', 'B']]

                   A         B
2022-01-01 -1.617605 -1.654238
2022-01-02  0.476262  0.090179
2022-01-03 -0.478995 -1.310525
2022-01-04 -0.339181 -0.168893
2022-01-05 -1.202923  0.487656
2022-01-06 -0.916765  0.393163

In [33]:
# Mostrando o fatiamento de rótulos, ambos os pontos de extremidade estão incluídos :
df.loc['2022-01-02':'2022-01-05', ['A', 'B']]

                   A         B
2022-01-02  0.476262  0.090179
2022-01-03 -0.478995 -1.310525
2022-01-04 -0.339181 -0.168893
2022-01-05 -1.202923  0.487656

In [36]:
#Redução nas dimensões do objeto retornado:
df.loc['20220102', ['A','B']]

A    0.476262
B    0.090179
Name: 2022-01-02 00:00:00, dtype: float64

In [40]:
# Para obter um valor escalar:
df.loc[dates[0], 'A']

-1.6176045805799986

In [41]:
#Para obter acesso rápido a um escalar (equivalente ao método anterior):
df.at[dates[0], "A"]

-1.6176045805799986

### 8 - Seleção por posição

In [43]:
df.iloc[3]

A   -0.339181
B   -0.168893
C    1.508616
D    0.201894
Name: 2022-01-04 00:00:00, dtype: float64

In [45]:
# Por fatias inteiras, agindo de forma semelhante ao NumPy/Python:
df.iloc[2:4, 0:2]

                   A         B
2022-01-03 -0.478995 -1.310525
2022-01-04 -0.339181 -0.168893

In [47]:
# Por listas de localizações de posições inteiras, semelhantes ao estilo NumPy/Python:
df.iloc[[1,2,3], [0,2]]

                   A         C
2022-01-02  0.476262  3.059522
2022-01-03 -0.478995  0.643576
2022-01-04 -0.339181  1.508616

In [74]:
#Para fatiar linhas explicitamente:
df.iloc[:, 0:2]

                   A         B
2022-01-01 -1.617605 -1.654238
2022-01-02  0.476262  0.090179
2022-01-03 -0.478995 -1.310525
2022-01-04 -0.339181 -0.168893
2022-01-05 -1.202923  0.487656
2022-01-06 -0.916765  0.393163

In [73]:
# Para obter um valor explicitamente:
df.iloc[1, 1]

0.09017879256947006

In [76]:
# Para obter acesso rápido a um escalar (equivalente ao método anterior):
df.iat[1,1]

0.09017879256947006

### 9 - Indexação booleana

In [77]:
# Usando os valores de uma única coluna para selecionar dados:
df[df['A'] > 0]

                   A         B         C         D
2022-01-02  0.476262  0.090179  3.059522 -0.730155

In [78]:
# Selecionando valores de um DataFrame onde uma condição booleana é atendida:
df[df > 0]

                   A         B         C         D
2022-01-01       NaN       NaN       NaN  1.470265
2022-01-02  0.476262  0.090179  3.059522       NaN
2022-01-03       NaN       NaN  0.643576  1.335813
2022-01-04       NaN       NaN  1.508616  0.201894
2022-01-05       NaN  0.487656  1.080697  1.438230
2022-01-06       NaN  0.393163       NaN  0.983764

In [79]:
# Usando o isin()método de filtragem:
df2 = df.copy()

In [80]:
df2['E'] = ['One', 'One', 'Two', 'Three', 'Four', 'Three']
df2

                   A         B         C         D      E
2022-01-01 -1.617605 -1.654238 -0.219917  1.470265    One
2022-01-02  0.476262  0.090179  3.059522 -0.730155    One
2022-01-03 -0.478995 -1.310525  0.643576  1.335813    Two
2022-01-04 -0.339181 -0.168893  1.508616  0.201894  Three
2022-01-05 -1.202923  0.487656  1.080697  1.438230   Four
2022-01-06 -0.916765  0.393163 -0.278418  0.983764  Three

In [81]:
df2[df2['E'].isin(['Two', 'Four'])]

                   A         B         C         D     E
2022-01-03 -0.478995 -1.310525  0.643576  1.335813   Two
2022-01-05 -1.202923  0.487656  1.080697  1.438230  Four

### 10- Dados Ausentes

In [85]:
# pandas usa principalmente o valor np.nan para representar dados ausentes. Por padrão, não é incluído nos cálculos. Consulte a seção Dados ausentes .

#A reindexação permite alterar/adicionar/excluir o índice em um eixo especificado. Isso retorna uma cópia dos dados:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0] : dates[1], 'E'] = 1
df1

                   A         B         C         D    E
2022-01-01 -1.617605 -1.654238 -0.219917  1.470265  1.0
2022-01-02  0.476262  0.090179  3.059522 -0.730155  1.0
2022-01-03 -0.478995 -1.310525  0.643576  1.335813  NaN
2022-01-04 -0.339181 -0.168893  1.508616  0.201894  NaN

In [87]:
# Para descartar todas as linhas com dados ausentes:
df1.dropna(how='any')

                   A         B         C         D    E
2022-01-01 -1.617605 -1.654238 -0.219917  1.470265  1.0
2022-01-02  0.476262  0.090179  3.059522 -0.730155  1.0

In [88]:
# Preenchendo dados ausentes:
df1.fillna(value=5)

                   A         B         C         D    E
2022-01-01 -1.617605 -1.654238 -0.219917  1.470265  1.0
2022-01-02  0.476262  0.090179  3.059522 -0.730155  1.0
2022-01-03 -0.478995 -1.310525  0.643576  1.335813  5.0
2022-01-04 -0.339181 -0.168893  1.508616  0.201894  5.0

In [89]:
# Para obter a máscara booleana onde os valores são nan:
pd.isna(df1)

                A      B      C      D      E
2022-01-01  False  False  False  False  False
2022-01-02  False  False  False  False  False
2022-01-03  False  False  False  False   True
2022-01-04  False  False  False  False   True